ChenSiyun1234/Sound-Tracking-Self-Balancing-Cart/STM32/Driver/ax_oled/ax_oled.h
/* ax_oled.h - STM32 self-balancing cart firmware (adapted from XTARK OpenCTR). */

  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AX_OLED_H
#define __AX_OLED_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "ax_delay.h"


void AX_OLED_Init(void);
void AX_OLED_ClearScreen(void);

void AX_OLED_DispChar(uint8_t x, uint8_t y, uint8_t ch, uint8_t mode);
void AX_OLED_DispStr(uint8_t x, uint8_t y, uint8_t *ch, uint8_t mode);
void AX_OLED_DispNum(uint8_t x, uint8_t y, uint8_t num, uint8_t mode);
void AX_OLED_DispValue(uint8_t x, uint8_t y, int32_t value, uint8_t inte, uint8_t deci, uint8_t mode);

void AX_OLED_Disp16Char(uint8_t x, uint8_t y, uint8_t ch, uint8_t mode);
void AX_OLED_Disp16Str(uint8_t x, uint8_t y, uint8_t *ch, uint8_t mode);
void AX_OLED_Disp16Num(uint8_t x, uint8_t y, uint8_t num, uint8_t mode);
void AX_OLED_Disp16Value(uint8_t x, uint8_t y, int32_t value, uint8_t inte, uint8_t deci, uint8_t mode);

void AX_OLED_DispPicture(uint8_t x, uint8_t y, uint8_t xsize, uint8_t ysize, const uint8_t *pbuf, uint8_t mode);
void AX_OLED_DispChinese(uint8_t x, uint8_t y, const uint8_t *pbuf, uint8_t mode);

#endif


